### jupyter 사용방법
* h : help
- a, b : 셀 추가
* m, y : 마크업 또는 코드
* dd : 셀 한 칸 삭제
* 컨트롤 + 엔터 : 실행

### pandas import

In [30]:
import pandas as pd

### 데이터 읽기

In [31]:
df = pd.read_csv("data/1.pandas.csv")

In [32]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

### Series : 1차원 배열
* [      ] Series 형식으로 가져온다.

In [15]:
print( df['name'])
print( df.age)

0     Kim
1     Cho
2    Choi
3      jo
Name: name, dtype: object
0    20
1    30
2    40
3    50
Name: age, dtype: int64

### [[ ]] DataFrame 형식으로 가져온다
* 여러개의 값을 가져오고자 하는 경우 [[]]

In [11]:
print( df[['name']] )
print( df[['name', 'age']])

   name
0   Kim
1   Cho
2  Choi
3    jo
   name  age
0   Kim   20
1   Cho   30
2  Choi   40
3    jo   50

### 인덱싱 : 인덱스의 범위를 지정한다

In [12]:
print( df[1:3]) #1~2까지의 데이터
print( df[:3]) # 처음부터 ~2 까지의 데이터
print( df[1:]) # 1 ~ 끝까지의 데이터

   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

### loc : DF.loc [ index조건식, 컬럼 조건식 ]

In [13]:
print( df.loc[1:3, 'name' ] )
print( df.loc[1:3, ['name', 'score'] ] )
print( df.loc[:, 'name' : 'grade' ] )
print( df.loc[:,  ] )

print("============")
print(df['grade']=='A')
print(df[ df['grade']=='A' ])

1     Cho
2    Choi
3      jo
Name: name, dtype: object
   name  score
1   Cho   95.0
2  Choi   90.5
3    jo   85.7
   name  score grade
0   Kim  100.0     A
1   Cho   95.0     A
2  Choi   90.5     B
3    jo   85.7     B
   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50
============
0     True
1     True
2    False
3    False
Name: grade, dtype: bool
  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

### DataFrame 삭제
* 인덱스를 기준으로 행 삭제

In [16]:
df.drop( 2 )

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
3   jo   85.7     B   50

In [17]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

* 인덱스 삭제하려면 삭제 시킨 것을 적용시켜줘야 함
* 위에서 처럼 삭제한 것만 보여주고 실제로는 적용 안됨

In [33]:
df = df.drop(3)
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40

* inplace 사용하여 삭제

In [34]:
df.drop(1, inplace = True)

In [35]:
df

   name  score grade  age
0   Kim  100.0     A   20
2  Choi   90.5     B   40

### axis
* 열 또는 행 중에 어떠한 값을 기준으로 설정할지 결정
* axis는 기본적으로 행(index)로 설정 되면 axis = 0 이다
* axis = 0 : index 삭제
* axis = 1 : 컬럼, 열 삭제

In [36]:
df.drop(0, axis=0, inplace = True)
df

   name  score grade  age
2  Choi   90.5     B   40

In [37]:
df.drop("score", axis=1, inplace=True)
df

   name grade  age
2  Choi     B   40

### Boolean 처리
* 특정 데이터 연산하면 결과는 True, False 이다
* DataFrame에 True 값을 전달하면 해당 위치의 값들을 얻어온다

In [38]:
df = pd.read_csv("data/1.pandas.csv")
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [39]:
df ['score'] < 95

0    False
1    False
2     True
3     True
Name: score, dtype: bool

* True인 결과값만 얻어옴

In [40]:
df[df ['score'] < 95]

   name  score grade  age
2  Choi   90.5     B   40
3    jo   85.7     B   50

* 위 결과값 중 name 만 가져올 때

In [41]:
df[df ['score'] < 95]['name']

2    Choi
3      jo
Name: name, dtype: object

* 위 코드를 loc 이용하여 작성

In [42]:
df.loc[ df['score']<95, 'name']

2    Choi
3      jo
Name: name, dtype: object

* loc 이용하여 여러 개의 값 가져오기

In [43]:
df.loc[ df['score']<95, ['name','score']]

   name  score
2  Choi   90.5
3    jo   85.7

* loc 이용하여 slicing 하기

In [44]:
df.loc[ df['score']<95, 'name' :'grade']

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

In [45]:
df[ df['score']< 95 ].loc[ : , 'name':'grade']

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

### Data Frame 명령어

In [46]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [47]:
df.columns

Index(['name', 'score', 'grade', 'age'], dtype='object')

* dtypes
    - 자료형을 알려준다
    - object : 문자열
    - float : 실수
    - int : 정수

In [48]:
df.dtypes

name      object
score    float64
grade     object
age        int64
dtype: object

In [49]:
df['grade']

0    A
1    A
2    B
3    B
Name: grade, dtype: object

* isin : 같은 글자가 있는지

In [51]:
df['grade'].isin(['A'])

0     True
1     True
2    False
3    False
Name: grade, dtype: bool

- True 인 결과만 가져오고 싶을 때

In [52]:
df [ df['grade'].isin(['A'])]

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

In [53]:
df.loc[ df['grade'].isin(['A']),['name', 'grade']]

  name grade
0  Kim     A
1  Cho     A

* index 이름 재설정

In [54]:
index_name = ['kim1', 'kim2', 'kim3', 'kim4']
df.index = index_name
df

      name  score grade  age
kim1   Kim  100.0     A   20
kim2   Cho   95.0     A   30
kim3  Choi   90.5     B   40
kim4    jo   85.7     B   50

In [55]:
df[1:3]

      name  score grade  age
kim2   Cho   95.0     A   30
kim3  Choi   90.5     B   40

In [56]:
df["kim1" : "kim4"]

      name  score grade  age
kim1   Kim  100.0     A   20
kim2   Cho   95.0     A   30
kim3  Choi   90.5     B   40
kim4    jo   85.7     B   50